zupcorp23012025.Расширение1/src/Documents/Аптека_НачислениеЗарплаты/Аптека_НачислениеЗарплаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Аптека_НачислениеЗарплаты</name>
  <registerRecords>InformationRegister.НачисленияЗППоАптекам</registerRecords>
  <registerRecords>AccumulationRegister.ЗГ_УдержанияСотрудниковОрганизации</registerRecords>
  <attributes>
    <name>ДатаС</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПо</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>НормаЧасовМесяц</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Минимум</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Максимум</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧАптека</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>Должность</name>
      <type>
        <types>CatalogRef.Должности</types>
      </type>
    </attributes>
    <attributes>
      <name>РазрядКатегория</name>
      <type>
        <types>CatalogRef.РазрядыКатегорииДолжностей</types>
      </type>
    </attributes>
    <attributes>
      <name>РазрядПодразделение</name>
      <type>
        <types>CatalogRef.РазрядыКатегорииДолжностей</types>
      </type>
    </attributes>
    <attributes>
      <name>МинимумПоСотруднику</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МаксимумПоСотруднику</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВсегоПоРасчету</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МинимумПоФакту</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МаксимумПоФакту</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИтогоДоГраниц</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОтработаноВсего</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИтогоЗаОтработанноеВремя</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Минимум</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Оклад0_166_Часы</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Оклад0_166Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Оклад2Часы</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Оклад2Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Оклад3_Часы</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Оклад3_Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Ночь_Часы</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Ночь_Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИтогоБонусов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>БонусНеДТМ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>БонусДТМ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>БонусЗаОптику</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>БонусАкции</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>БонусЗМЗ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>БонусОценка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Доплата1</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Доплата2</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПремияМин</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПремияМакс</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОсновнаяАптека</name>
      <type>
        <types>CatalogRef.ПодразделенияОрганизаций</types>
      </type>
    </attributes>
    <attributes>
      <name>ТН</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИНН</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Уволенная</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ОкладПоЧасам</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбщаяПремия</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПремияЗаКатегориюСтоимость</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоплатаЗаКатегорию</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Статус1</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Статус2</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПраздникиДеньЧасы</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПраздникиДеньСумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПраздникиНочьЧасы</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПраздникиНочьСумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЭлементВыбран</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПремияНочнаяСтоимость</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПремияНочнаяСумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КолПринятыхЗвонков</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПремияЗвонки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КолСобранныхУпаковок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПремияУпаковки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

zupcorp23012025.Расширение1/src/AccumulationRegisters/ЗГ_УдержанияСотрудниковОрганизации/ЗГ_УдержанияСотрудниковОрганизации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ЗГ_УдержанияСотрудниковОрганизации</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

zupcorp23012025.Расширение1/src/Documents/Аптека_НачислениеЗарплаты/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	////АК Начало Хаустов С.А.
	Движения.ЗГ_УдержанияСотрудниковОрганизации.Записывать = Истина;
	////АК Конец Хаустов С.А.
	
	// регистр НачисленияЗППоАптекам
	Движения.НачисленияЗППоАптекам.Записывать = Истина;
	Для Каждого ТекСтрокаТЧАптека Из ТЧАптека Цикл
		Движение = Движения.НачисленияЗППоАптекам.Добавить();
		Движение.Период = ДатаС;
		Движение.Подразделение = Подразделение;
		Движение.ФизическоеЛицо = ТекСтрокаТЧАптека.Сотрудник;
		Движение.Должность = ТекСтрокаТЧАптека.Должность;
		Движение.ОсновнаяАптека = ТекСтрокаТЧАптека.ОсновнаяАптека;
		Движение.ТН = ТекСтрокаТЧАптека.ТН;
		Движение.ИНН = ТекСтрокаТЧАптека.ИНН;
		Движение.ВсегоПоРасчету = ТекСтрокаТЧАптека.ВсегоПоРасчету;
		Движение.МинимумПоФакту = ТекСтрокаТЧАптека.МинимумПоФакту;
		Движение.МаксимумПоФакту = ТекСтрокаТЧАптека.МаксимумПоФакту;
		Движение.ИтогоДоГраниц = ТекСтрокаТЧАптека.ИтогоДоГраниц;
		Движение.ОтработаноВсего = ТекСтрокаТЧАптека.ОтработаноВсего;
		Движение.ИтогоЗаОтработанноеВремя = ТекСтрокаТЧАптека.ИтогоЗаОтработанноеВремя;
		Движение.Минимум = Минимум;
		Движение.Оклад0_166_Часы = ТекСтрокаТЧАптека.Оклад0_166_Часы;
		Движение.Оклад0_166Сумма = ТекСтрокаТЧАптека.Оклад0_166Сумма;
		//Движение.Оклад2Часы = ТекСтрокаТЧАптека.Оклад2Часы;
		//Движение.Оклад2Сумма = ТекСтрокаТЧАптека.Оклад2Сумма;
		//Движение.Оклад3_Часы = ТекСтрокаТЧАптека.Оклад3_Часы;
		//Движение.Оклад3_Сумма = ТекСтрокаТЧАптека.Оклад3_Сумма;
		Движение.Ночь_Часы = ТекСтрокаТЧАптека.Ночь_Часы;
		Движение.Ночь_Сумма = ТекСтрокаТЧАптека.Ночь_Сумма;
		Движение.ПраздникиДеньЧасы=ТекСтрокаТЧАптека.ПраздникиДеньЧасы;
		Движение.ПраздникиДеньСумма=ТекСтрокаТЧАптека.ПраздникиДеньСумма;
		Движение.ПраздникиНочьЧасы=ТекСтрокаТЧАптека.ПраздникиНочьЧасы;
		Движение.ПраздникиНочьСумма=ТекСтрокаТЧАптека.ПраздникиНочьСумма;
		Движение.ИтогоБонусов = ТекСтрокаТЧАптека.ИтогоБонусов;
		Движение.БонусНеДТМ = ТекСтрокаТЧАптека.БонусНеДТМ;
		Движение.БонусДТМ = ТекСтрокаТЧАптека.БонусДТМ;
		Движение.БонусЗаОптику=ТекСтрокаТЧАптека.БонусЗаОптику;
		Движение.БонусАкции = ТекСтрокаТЧАптека.БонусАкции;
		Движение.БонусЗМЗ = ТекСтрокаТЧАптека.БонусЗМЗ;
		//Движение.БонусОценка = ТекСтрокаТЧАптека.БонусОценка;
		Движение.Доплата1 = ТекСтрокаТЧАптека.Доплата1;
		Движение.Доплата2 = ТекСтрокаТЧАптека.Доплата2;
		Движение.ПремияМин = ТекСтрокаТЧАптека.ПремияМин;
		Движение.ПремияМакс = ТекСтрокаТЧАптека.ПремияМакс;
		Движение.ОкладПоЧасам = ТекСтрокаТЧАптека.ОкладПоЧасам;
		Движение.ОбщаяПремия = ТекСтрокаТЧАптека.ОбщаяПремия;
		Движение.ПремияЗаКатегориюСтоимость=ТекСтрокаТЧАптека.ПремияЗаКатегориюСтоимость;
		Движение.ДоплатаЗаКатегорию = ТекСтрокаТЧАптека.ДоплатаЗаКатегорию;
		Движение.Статус1 = ТекСтрокаТЧАптека.Статус1;
		Движение.Статус2 = ТекСтрокаТЧАптека.Статус2;
		Движение.РазрядКатегория=ТекСтрокаТЧАптека.РазрядКатегория;
		Движение.РазрядПодразделение=ТекСтрокаТЧАптека.РазрядПодразделение;
		Движение.ПремияНочнаяСтоимость=ТекСтрокаТЧАптека.ПремияНочнаяСтоимость;
		Движение.ПремияНочнаяСумма=ТекСтрокаТЧАптека.ПремияНочнаяСумма;
		Движение.Уволен=ТекСтрокаТЧАптека.Уволенная;
		
		Движение.КолПринятыхЗвонков=ТекСтрокаТЧАптека.КолПринятыхЗвонков;
		Движение.БонусЗвонки=ТекСтрокаТЧАптека.ПремияЗвонки;
		Движение.КолСобранныхУпаковок=ТекСтрокаТЧАптека.КолСобранныхУпаковок;
		Движение.БонусСтрокиЗаказов=ТекСтрокаТЧАптека.ПремияУпаковки;
		
		////АК Начало Хаустов С.А.
		Если ЗначениеЗаполнено(ТекСтрокаТЧАптека.Доплата2) Тогда
			Движение = Движения.ЗГ_УдержанияСотрудниковОрганизации.ДобавитьРасход();
			Движение.Период = ДатаС;
			Движение.ФизическоеЛицо = ТекСтрокаТЧАптека.Сотрудник;
			Движение.Сумма = - ТекСтрокаТЧАптека.Доплата2;
		КонецЕсли;
		////АК Конец Хаустов С.А.

    КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
